Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ཞོ་དང་། སྦྲང་རྩི་དང་། མར་བསྲེས་པས། ས་མཱའི་ཤིང་གི་ཞི་བའི་མེ་སྤར་ཏེ་སྟོང་ཕྲག་བརྒྱད་དུ་སྦྱིན་སྲེག་བྱའོ། །དེ་ནས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་གི་གཟུགས་ཀྱིས་མདུན་དུ་ཉེ་བར་གནས་ཏེ། མཆོག་ཐམས་ཅད་སྦྱིན་པར་འགྱུར་རོ།
en: If he lights the fire using sticks of śamī tree smeared with agarwood, curds, honey, and ghee, and offers one thousand and eight homas of sandalwood, lotus stalks, parched rice, and mustard seeds, Noble Avalokiteśvara will appear before him and grant him every boon.

source: །བྱ་བ་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་ཏུ་ཡང་འགྱུར་རོ། །ཡིད་ཀྱི་ཤིང་རྟ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་ཡང་འགྱུར་རོ། །ཆོ་ག་ཞིབ་མོ་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་ཏུ་ཡང་འགྱུར་རོ།
en: The vidyā holder will then succeed in all his endeavors, all his wishes will be fulfilled, and he will accomplish all rites.

source: །ཐམས་ཅད་དུ་དོན་ཡོད་པ་ཐོགས་པ་མེད་པའི་དངོས་གྲུབ་ཏུ་ཡང་འགྱུར་རོ། །བསོད་ནམས་ཐམས་ཅད་འགུགས་པའི་དངོས་གྲུབ་ཏུ་ཡང་འགྱུར་རོ། །དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོ་དང་།
en: He will obtain the amogha siddhi of complete unobstructability and the siddhi of attracting all merit.

source: སྒྲུབ་པའི་ཆོ་ག་ཐམས་ཅད་ཀྱི་མཆོག་གི་དངོས་གྲུབ་ཏུ་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་དམ་ཚིགས་གསང་བ་ལ་རྗེས་སུ་ཞུགས་པར་འགྱུར་རོ། །སེང་ལྡེང་དང་། ནིམ་པའི་ཤིང་གི་ཡམ་ཤིང་གི་འབྲས་སཱ་ལུ་དང་། ཏིལ་དང་། ཡུངས་ཀར་དང་། ཞོ་དང་། མར་དང་།
en: He will also obtain the supreme accomplishment of all maṇḍalas, mudrās, rites, and practice procedures and will enter the secret samaya of all the tathāgatas. “

source: ལན་ཚྭ་དང་བསྲེས་པ་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན། བགེགས་དང་། ལོག་པར་འདྲེན་པ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོའི་གདོན་ཐམས་ཅད་དང་། གདུག་པ་དང་།
en: If he lights the fire using sticks of cutch tree and neem tree for fuel and offers one thousand and eight homas of rice grains, sesame seeds, and mustard seeds mixed with curds, ghee, and salt, all vighnas, vināyakas, yakṣas, rākṣasas, and grahas and all wicked opponents and adversaries will be pacified.

source: ཕྱིར་རྒོལ་བ་དང་། དགྲ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་ལས་སྒྲོལ་བར་བྱེད་དོ། །མཚོན་ཆ་ཐམས་ཅད་ལས་རྒྱལ་བར་འགྱུར་རོ།
en: He will be able to avoid all discords, quarrels, and disputes, and he will win victory in every battle.

source: །ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། ཕྱིར་རྒོལ་བ་དང་། དགྲ་ཐམས་ཅད་ལས་རྒྱལ་བ་སྦྱིན་པར་འགྱུར་རོ། །ཙནྡན་དང་། འབྲས་ཡོས་དང་། ཞོ་དང་།
en: He will defeat all foreign armies, as well as his adversaries and opponents. “

source: སྦྲང་རྩི་དང་། མར་བསྲེས་པའི་པདྨའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན། ཡུལ་འཁོར་དང་། རི་བྲགས་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། ལྗོངས་རྣམས་སུ། ཀུན་ནས་དཔག་ཚད་སྟོང་ཕྲག་གཅིག་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཞི་བ་ཆེན་པོར་འགྱུར་རོ།
en: If he offers one thousand and eight homas of lotus flowers, sandalwood, and parched rice smeared with curds, honey, and ghee, this will bring great peace to all inhabited places—countries, cities, towns, and villages—within the radius of one thousand leagues.

source: །སེམས་ཅན་ཐམས་ཅད་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་རྣམས་ལ་བསྲུང་བ་དང་།
en: It will ensure that all beings—women, men, boys, and girls—will be guarded, protected, and defended.

source: བསྐྱབ་པའི་ཆེད་དུ་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་རོ། །ནད་ཐམས་ཅད་ཐམས་ཅད་དུ་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: All diseases everywhere will be pacified.

source: །གཅན་གཟན་གཏུམ་པོ་ཐམས་ཅད་དང་། སྦྲུལ་གདུག་པ་དང་། མ་རུངས་པ་ཐམས་ཅད་བྱམས་པར་འགྱུར་རོ།
en: All wild animals, āśīviṣa snakes, and wicked beings will become loving.

source: །རྒྱལ་པོ་དང་། ཡུལ་འཁོར་དང་། བཙུན་མོའི་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཐམས་ཅད་ཤིས་པ་དང་བདེ་བར་འགྱུར་རོ།
en: All kings, along with their courts, harems, and retinues, will live in comfort and happiness. “

source: །མ་ཏམ་ག་དང་། ཡུངས་ཀར་དང་། མར་དང་། ཀླུ་ཤིང་གི་མེ་ཏོག་དང་། འབྲས་ཡོས་རྣམས་བསྲེས་པས་ཨརྐའི་ཤིང་གི་ཡམ་ཤིང་གི་མེ་སྦར་ལ་སྟོང་ཕྲག་བརྒྱད་དུ་སྦྱིན་སྲེག་བྱས་ན་ཆར་མི་འབབ་པར་བྱེད་པ་ལ།
en: If he lights the fire using sticks of giant milkweed for fuel and offers one thousand and eight homas of mataṅga, mustard seeds, ghee, nāgapuṣpa, and parched rice, it will stop a drought.

source: དེ་ནས་ཀླུ་ཆེན་པོ་རྣམས་ཀྱིས་ཆར་གྱི་རྒྱུན་འབྱིན་པར་བྱེད་དེ་ཇི་སྲིད་ཆར་པ་འབབ་པར་འདོད་པའི་བར་དུའོ། །ལོ་ཐོག་དང་། ཤིང་དང་། རྩྭ་དང་།
en: The great nāgas will release torrents of rain for as long as desired.

source: ཤིང་གེལ་པ་དང་། སྨན་གྱི་རྫས་དང་། མེ་ཏོག་དང་། འབྲས་བུ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །ལེགས་པར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: All crops, trees, grasses, bushes, medicinal herbs and substances, flowers, and fruits will grow fully and ripen well.

source: །ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་ཀྱིས་དགའ་བ་ཆེན་པོར་འགྱུར་ཞིང་། དུས་དུས་སུ་ཇི་ལྟར་བ་བཞིན་དུ་ཆར་གྱི་རྒྱུན་འབྱིན་པར་བྱེད་དོ།
en: All the great nāga kings and their retinues will be very pleased and will send timely, abundant rain whenever necessary.

source: །ཧ་ཅང་ཆར་ཆེས་ན་དེ་ཉིད་ཀྱི་ཐལ་བས་སྟོང་ཕྲག་བརྒྱད་དུ་སྦྱིན་སྲེག་བྱས་ན་ཧ་ཅང་ཆར་ཆེས་པ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །འབྲས་ཡོས་དང་།
en: If it rains too much, the vidyā holder should offer one thousand and eight homas of the ashes left after the previous homa offering, and the excessive rain will stop. “

source: གོ་ལ་དང་། ཡུངས་ཀར་དང་། གཏུམ་པོའི་ས་བོན་མར་དང་བསྲེས་པའི་སྦྱིན་སྲེག་བྱས་ན། རླུང་དང་སེར་བ་ཐམས་ཅད་ཟློག་པར་བྱེད་དོ། །དཔག་ཚད་སྟོང་ཕྲག་ཁོར་ཡུག་ཏུ་མཚམས་ཆེན་པོ་བཅིང་བར་བྱས་པར་འགྱུར་རོ།
en: If the vidyā holder offers a homa of rice balls, mustard seeds, and datura seeds smeared with ghee, all windstorms and hail will be stopped, and a great protective boundary will be created with a radius of one thousand leagues.

source: །རླུང་བཅིང་བ་ལ་ཡུངས་ཀར་དང་འབྲས་ཐུག་པོ་ཆེའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: To stop a hurricane, the vidyā holder should offer one thousand and eight homas of mustard seeds and parched rice.

source: རླུང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་བཅིང་བར་བྱས་པར་འགྱུར་ཏེ། ཇི་སྲིད་དུ་བེ་རམ་བྷའི་རླུང་གི་བར་དུ་བཅིངས་པར་འགྱུར་རོ།
en: This will arrest all whirlwinds, and all winds up to and including hurricanes. “

source: །ཀླུ་བཅིང་བ་ལ་ནི་ཡུངས་ཀར་དང་། ཏིལ་གྱི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: In order to bind nāgas, the vidyā holder should offer one thousand and eight homas of mustard seeds and sesame seeds.

source: ལོ་བཅུ་གཉིས་སུ་ཀླུ་བཅིང་བ་བྱས་པར་འགྱུར་རོ།
en: The nāgas will then be bound for twelve years.

source: །ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་ནི། ཡུངས་ཀར་མར་དང་བསྲེས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: To pacify all diseases, he should offer one thousand and eight homas of mustard seeds smeared with ghee. All diseases will then be eradicated.

source: །ཕ་རོལ་གྱི་དམག་ཚོགས་ཟློག་པ་ནི། ཀ་ར་བཱི་རའི་ཤིང་གིས་མེ་སྦར་ཏེ། ནི་མ་པའི་འདབ་མ་དང་། ལན་ཚྭ་དང་། ཕུབ་མའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: To ward off a foreign army, he should light the fire using oleander sticks and offer one thousand and eight homas of neem leaves, salt, and chaff.

source: ཕ་རོལ་གྱི་དམག་ཚོགས་དང་། ཕྱིར་རྒོལ་པ་དང་། དགྲ་ཐམས་ཅད་རྣམ་པར་ཉམས་པར་བྱེད་དེ།
en: The entire enemy army, together with all adversaries and opponents, will then perish.

source: ཇི་སྲིད་འཚོའི་བར་དུ་ཕྱིས་འབྱུང་བར་མི་འགྱུར་རོ།
en: They will not appear again for as long as the vidyā holder lives. “

source: །ཕྱོགས་བཅིང་བ་ལ་དཔག་ཚད་སྟོང་ཕྲག་ཁོར་ཡུག་གིས་སོ། །ཏིལ་དང་། ཡུངས་ཀར་དང་། འབྲས་ཡོས་དང་། པདྨའི་འདབ་མ་མར་དང་བསྲེས་པས་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: To bind the directions within the radius of one thousand leagues, the vidyā holder should offer one thousand and eight homas of sesame seeds, mustard seeds, parched rice, and lotus leaves smeared with ghee.

source: དཔག་ཚད་སྟོང་ཕྲག་ཁོར་ཡུག་ཏུ་མཚམས་ཆེན་པོ་བཅིང་པ་བྱས་པར་འགྱུར་རོ།
en: This will create a great protective boundary with the radius of one thousand leagues.

source: །ལོག་འདྲེན་ཐམས་ཅད་བཅིང་བ་ལ་ནི། ཡུངས་ཀར་ནག་པོ་དང་། ཏིལ་ནག་དང་། སྲན་མ་དང་། ཏིལ་དང་མར་བསྲེས་པས་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་བགེགས་དང་།
en: To bind all vināyakas, the vidyā holder should offer one thousand and eight homas of mustard seeds, black sesame seeds, beans, and sesame seeds, all mixed with ghee.

source: ལོག་འདྲེན་དང་། བདུད་ལ་སོགས་པ་མ་རུངས་པ་དང་། གནོད་སྦྱིན་དང་སྲིན་པོ་རྣམས་བཅིང་བ་བྱས་པར་འགྱུར་རོ། །གནོད་སྦྱིན་འབྱིན་པ་ལ་ནི།
en: All vighnas, vināyakas, māras, and other such beings, including the wicked yakṣas and rākṣasas, will be bound.

source: བྷཾ་གའི་ས་བོན་དང་། ལན་ཚྭ་དང་། ཏིལ་མར་བསྲེས་པས་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: To expel yakṣas from their abodes, the vidyā holder should offer one thousand and eight homas of marijuana seeds and salt mixed with sesame oil.

source: གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་དང་། བརྗེད་བྱེད་ལ་སོགས་པ་ཐམས་ཅད་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མངོན་སུམ་དུ་ངེས་པར་འབྱིན་པར་འགྱུར་རོ།
en: All yakṣas, rākṣasas, bhūtas, piśācas, apasmāras, and so forth will be forced to come out and be clearly visible to everyone.

source: །ཡམས་དང་། ཉེ་བར་འཚེ་བ་དང་། ནད་འགོ་བ་ཐམས་ཅད་དང་། འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །དགེ་ལེགས་ཐམས་ཅད་འབྱུང་བར་འགྱུར་རོ།
en: All misfortunes, calamities, disasters, and dangers will be completely pacified so that everyone will live in peace. “

source: །བྲམ་ཟེ་དབང་དུ་བྱེད་པ་ལ། འབྲས་ཡོས་དང་། ཨརྐའི་ཡམ་ཤིང་མར་གྱིས་བཏགས་པས་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་བྲམ་ཟེ་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ།
en: To enthrall a brahmin, the vidyā holder should offer one thousand and eight homas of parched rice and sticks of giant milkweed smeared with ghee.

source: །རྒྱལ་རིགས་དབང་དུ་བྱེད་པ་ལ། བུ་རམ་དང་། མར་དང་། འབྲས་ཡོས་དང་། ཨརྐའི་འདབ་མས་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན། རྒྱལ་རིགས་ཐམས་ཅད་དབང་དུ་བྱེད་པར་འགྱུར་རོ།
en: To enthrall a kṣatriya, he should offer one thousand and eight homas of molasses, ghee, parched rice, and leaves of giant milkweed.

source: །དམངས་རིགས་དབང་དུ་བྱེད་པ་ལ། མྱོས་བྱེད་ཀྱི་འབྲས་བུ་དང་། དོང་ཀའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: To enthrall a śūdra, the vidyā holder should offer one thousand and eight homas of madaphala and karṇikārikā.

source: དམངས་རིགས་ཐམས་ཅད་དབང་དུ་བྱེད་པའི་མཆོག་འགྲུབ་བོ།
en: This is the most effective method of enthralling any śūdra.

source: །རྗེ་རིགས་དབང་དུ་བྱེད་པ་ལ། མར་རྣམ་པ་གསུམ་གྱིས་བསྲེས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན། རྗེ་རིགས་ཐམས་ཅད་དབང་དུ་བྱེད་དོ།
en: To enthrall a vaiśya, he should offer one thousand and eight homas of the three types of ghee mixed together. “

source: །སྣ་མའི་མེ་ཏོག་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན། བུད་མེད་ཐམས་ཅད་དབང་དུ་བྱེད་པར་འགྱུར་རོ། །གཞོན་ནུ་མ་དབང་དུ་བྱེད་པ་ལ།
en: If the vidyā holder offers one thousand and eight homas of jasmine flowers smeared with ghee, all women will be enthralled.

source: ཆུའི་མེ་ཏོག་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན། གཞོན་ནུ་མ་ཐམས་ཅད་དབང་དུ་བྱེད་པར་འགྱུར་རོ།
en: To enthrall a virgin, the vidyā holder should offer one thousand and eight homas of jalakusuma smeared with ghee. “

source: །འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པ་ལ། འབྲུ་དང་མར་གྱི་སྦྱིན་སྲེག་ཕྲག་བརྒྱད་བྱས་ན།
en: To pacify all fears, the vidyā holder should offer one thousand and eight homas of rice grains smeared with ghee.

source: །འཇིགས་པ་དང་། འཐབ་མོ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དོ།
en: All fear, discord, quarrels, and disputes will then be pacified.

source: །ནོར་དང་འབྲུ་འཕེལ་བར་བྱེད་པ་ལ། འབྲུ་བདུན་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་ནོར་དང་འབྲུ་འཕེལ་བར་འགྱུར་རོ། །དབང་ཕྱུག་ཐོབ་པ་ལ། ཡུངས་ཀར་དང་།
en: To obtain money and grain, he should offer one thousand and eight homas of the seven types of grain smeared with ghee.

source: མངྔྷཱཿདང་།
en: His money and his grain will then increase.

source: སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་དབང་ཕྱུག་ཆེན་པོ་འཕེལ་བར་འགྱུར་རོ།
en: To obtain influence and power, he should offer one thousand and eight homas of mustard seeds and beans. His worldly power will greatly increase.

source: །ཡུལ་ཐོབ་པ་ལ། ཚབ་གསུམ་མར་དང་། མདྡྷཱཿདང་བསྲེས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: To obtain a domain, the vidyā holder should offer one thousand and eight homas of the three spices, ghee, and beans.

source: ཡུལ་ཆེན་པོ་ཐོབ་པར་འགྱུར་རོ།
en: He will then obtain a large domain.

source: །གྲོང་གི་དོན་དུ་ཀ་ར་བཱི་རའི་མེ་ཏོག་དང་། ཡུངས་ཀར་དང་། འབྲས་ཡོས་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་གྲོང་རྙེད་པར་འགྱུར་རོ།
en: When desiring to obtain a village, he should offer one thousand and eight homas of oleander flowers, mustard seeds, and parched rice smeared with ghee.

source: །གཏེར་གདོན་པ་ལ་ནི།
en: He will then obtain a village. “

source: པདྨའི་ཆུ་བ་མར་དང་བསྲེས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་གཏེར་ཆེན་པོ་སོ་སོར་རྙེད་དོ།
en: If the vidyā holder wants to dig up buried treasure, he should offer one thousand and eight homas of lotus stalks smeared with ghee. He will then find a great treasure.

source: །གནོད་སྦྱིན་སྤྱན་དྲང་བར་འདོད་པས། གུ་གུལ་དང་། གཏུམ་པོའི་ས་བོན་དང་། སྦྲང་རྩི་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: If he wants to summon a yakṣa, he should offer one thousand and eight homas of bdellium and datura seeds smeared with honey and ghee.

source: གནོད་སྦྱིན་རང་གི་གཟུགས་ཀྱིས་མདུན་དུ་ཉེ་བར་འདུག་སྟེ། ཅི་བསྒོ་བ་བྱེད་ཅིང་ལས་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ། །འདོད་པའི་གཟུགས་ཅན་མ་སྤྱན་དྲང་བར་འདོད་པས་འབྲས་ཡོས་དང་།
en: The yakṣa will then appear before him in its yakṣa form and become his servant, eager to perform all kinds of tasks.

source: ཡུངས་ཀར་དང་། ཞོ་དང་། སྦྲང་རྩི་དང་། མར་གྱིས་བཏགས་པའི་དྲི་དང་། པྲི་ཡང་ཀུའི་ཀར་བཱི་རའི་ཤིང་གི་ཡམ་ཤིང་གིས་མེ་སྦར་ནས་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་དེའི་འོག་ཏུ་འདོད་པའི་གཟུགས་ཅན་མ་འོངས་ཏེ།
en: If he wants to summon Kāmarūpī, he should offer one thousand and eight homas of parched rice, mustard seeds, and mahaleb cherry smeared with curds, honey, and ghee.

source: ཇི་ལྟར་འདོད་པ་བཞིན་དུ་སྤྱོད་པར་བྱེད་དོ།
en: The fire should be kindled with oleander sticks, after which Kāmarūpī will arrive and do whatever the vidyā holder wants her to do.

source: །རྣམ་པ་གསུམ་བརྗོད་པར་བྱ་སྟེ། མ་དང་། ཆུང་མ་དང་། སྲིང་མོའོ།
en: He can make three types of request: either that she becomes his mother, his wife, or his sister. “

source: །གལ་ཏེ་མ་ཡིན་ན་བུ་ལ་ཞེན་པས། ནོར་དང་། འབྲུ་དང་། ལོངས་སྤྱོད་ཆེན་པོ་རྣམ་པར་འཕེལ་ཞིང་ཕུན་སུམ་ཚོགས་པར་བྱེད་དེ། ཇི་སྲིད་འཚོའི་བར་དུ་མི་འབྲལ་བར་ཀུན་དུ་གནས་པར་བྱེད་དོ།
en: If Kāmarūpī becomes his mother, she will love him with the love a mother has for her son, will make his money, grain, and pleasures greatly increase, and will be an ideal companion for him as long as he lives.

source: །གལ་ཏེ་ཆུང་མ་ཡིན་ན། རྣམ་པ་སྣ་ཚོགས་པའི་དགའ་བ་དུ་མས་རྩེ་ཞིང་། ལོངས་སྤྱོད་ལ་ཡོངས་སུ་སྤྱོད་པར་བྱེད་དེ།
en: If she becomes his wife, she will serve him with various kinds of pleasure, including many types of sexual play.

source: རྣམ་པ་སྣ་ཚོགས་པའི་གོས་དང་། རྒྱན་དང་། ལྷབ་ལྷུབ་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། བཟའ་བ་དང་། བཏུང་བ་རྣམ་པ་སྣ་ཚོགས་པའི་རོ་བྲོ་བའི་ལོངས་སྤྱོད་ལ་ཡོངས་སུ་སྤྱོད་ཅིང་།
en: She will give him various garments, adornments, ornaments, fragrances, and scented oils, and she will serve him with the pleasures of the palate, offering him food and drink with a variety of exquisite flavors.

source: རྣམ་པ་སྣ་ཚོགས་པའི་མལ་སྟན་དང་། ནོར་དང་། འབྲུ་དང་། མཛོད་དང་། བང་བ་དང་བཅས་པ་རྣམ་པར་འཕེལ་བ་ལ་ཡོངས་སུ་སྤྱོད་དེ།
en: She will offer him various beds and seats and will cause his stores of money and grain to greatly increase.

source: ཇི་སྲིད་འཚོའི་བར་དུ་གྲིབ་མ་བཞིན་དུ་རྗེས་སུ་འབྲང་བར་འགྱུར་རོ། །སྲོག་ཀྱང་ཡོངས་སུ་གཏོང་བར་བྱེད་དོ།
en: She will follow him like a shadow for as long as he lives and will even sacrifice her own life for him.

source: །གལ་ཏེ་སྲིང་མོ་ཡིན་ན་དེའི་ཚེ། རྣམ་པ་སྣ་ཚོགས་པའི་དབང་ཕྱུག་དང་། ལྷའི་གཞལ་མེད་ཁང་ན་ལོངས་སྤྱོད་ལ་ཡོངས་སུ་སྤྱོད་ཅིང་།
en: If she becomes his sister, she will grant him influence and will serve him with the pleasures that are experienced in celestial palaces.

source: ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་དང་རིམ་གྲོ་བྱེད་དོ།
en: She will attend upon him and serve him for as long as he lives. “

source: །ཕ་རོལ་གྱི་དམག་ཚོགས་བཟློག་པ་ལ་ཕུབ་མ་དང་། ལན་ཚྭའི་སྦྱིན་སྲེག་གིས་དཔག་ཚད་བརྒྱ་སྟོང་ཕྲག་གི་ནང་དུ་དགྲ་མི་འབྱུང་སྟེ།
en: If the vidyā holder wants to obliterate foreign armies—any enemies that are found within the radius of one hundred thousand leagues—he should offer one thousand and eight homas of chaff and salt.

source: སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་གཡུལ་དང་འཁྲུག་པ་ཆེན་པོ་ལས་རྒྱལ་བར་འགྱུར་རོ།
en: He will then win a great victory in armed combat and in war.

source: །ཉི་མ་འབབ་པར་བྱེད་པ་ལ། རིའི་རྩེ་མོར་སྦྲང་རྩི་དང་། ན་ལེ་ཤམ་དང་། འབྲས་ཐུག་པོ་ཆེ་དང་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན་ཉིན་རེ་རེ་ཞིང་ཉི་མ་འབབ་པར་བྱེད་དོ།
en: To cause Āditya to descend to earth, he should offer, while on top of a mountain, one thousand and eight homas of honey, black pepper, and rice grains smeared with ghee.

source: །མཆོག་ཐམས་ཅད་རྗེས་སུ་སྩོལ་བར་བྱེད་ཅིང་།
en: Āditya will descend to earth every single day and grant the vidyā holder every boon.

source: ཇི་སྲིད་འཚོའི་བར་དུ་འདོད་པ་ཙམ་གྱིས་བསྙེན་བཀུར་དང་། རིམ་གྲོ་བྱེད་ཅིང་ཉེ་བར་གནས་སོ། །ཟླ་བ་དང་།
en: He will serve him with every kind of desirable service for as long as he lives. “

source: རྒྱུ་སྐར་དང་། སྐར་མའི་ཚོགས་འབབ་པར་འདོད་པས་གནས་མཐོན་པོར་ཚ་བ་གསུམ་དང་། རྒྱམ་ཚྭ་དང་། ལན་ཚྭ་དང་། འོ་མ་དང་། སྦྲང་རྩི་དང་མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་བྱས་ན་ཟླ་བ་དང་། རྒྱུ་སྐར་དང་།
en: If the vidyā holder wants to cause Candra to descend to earth together with the nakṣatras and the multitude of stars, he should offer the homa consisting of the three spices mixed with sea salt, salt, milk, honey, and ghee while at an elevated place.

source: སྐར་མའི་ཚོགས་འབབ་པར་བྱེད་དེ། འདོད་པ་དང་། ཡིད་ཀྱི་ཤིང་རྟ་དང་། བསྐལ་པ་དང་། དབང་ཕྱུག་ཐམས་ཅད་ཆེར་འཕེལ་བ་རབ་ཏུ་སྦྱིན་ནོ།
en: Candra, together with the nakṣatras and the multitude of stars, will then descend to earth, fulfill all his desires, and grant all his wishes, thus causing his power and pleasures to greatly increase.

source: །ཇི་སྲིད་འཚོའི་བར་དུ་ཉེ་བར་གནས་ཏེ། ཇི་སྲིད་འཚོའི་བར་དུ་སྲུང་བ་དང་། སྐྱོབ་པ་དང་། སྤ་བ་བྱེད་པར་འགྱུར་རོ།
en: He will attend upon him for as long as the vidyā holder lives, and he will protect, guard, and defend him for the rest of the vidyā holder’s life.

source: །ཉི་མ་རེ་རེ་ཞིང་མཐོང་བར་འདོད་ན་འབབ་པར་བྱེད་དོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་།
en: Every day, he will descend to earth whenever the vidyā holder wants to see him. “

source: བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེ་རིགས་དང་། དམངས་རིགས་ཐམས་ཅད་འགུགས་པ་ལ་ཏིལ་དང་། ཡུངས་ཀར་དང་། འབྲས་ཐུག་པོ་ཆེ་དང་། སྨན་སྣ་ཚོགས་དང་། ཞོ་དང་། སྦྲང་རྩི་དང་། མར་གྱིས་བཏགས་པའི་སྦྱིན་སྲེག་སྟོང་ཕྲག་བརྒྱད་བྱས་ན།
en: If the vidyā holder wants to summon any being—a deva, nāga, yakṣa, gandharva, asura, garuḍa, kinnara, mahoraga, uraga, human, or nonhuman, be they a woman, man, boy, girl, monk, brahmin, kṣatriya, vaiśya, or śūdra—he should offer one thousand and eight homas of sesame seeds, mustard seeds, rice grains, and dry ginger smeared with curds, honey, and ghee.

source: འགུགས་པ་ཆེན་པོའི་དངོས་གྲུབ་ཏུ་འགྱུར་ཏེ།
en: This will ensure great success in the summoning.

source: འཇིག་རྟེན་ཐམས་ཅད་དགའ་བར་ཡང་འགྱུར་རོ། །རྒྱལ་པོ་དང་། བཙུན་མོའི་འཁོར་དང་གཡོག་ཏུ་བཅས་པ་འཁོར་དུ་འགྱུར་ཏེ།
en: The vidyā holder will be loved by everyone, and kings, together with their harems and retinues, will fall under his thrall.

source: རྟག་ཏུ་དེ་ཉིད་ཀྱི་རྗེས་སུ་འབྲང་བར་འགྱུར་ལ་ངག་གི་རྗེས་སུ་འཇུག་པར་འགྱུར་རོ། །བདག་ཉིད་ཀྱིས་སམ་ནོར་གྱིས་ཀྱང་རུང་སྟེ།
en: They will remain bound to him, listen to his words, and serve him both physically and with their wealth.

source: ཐམས་ཅད་དུ་བླ་མ་གཅིག་པུར་མཆོད་པ་ཆེན་པོ་བྱེད་པར་འགྱུར་རོ།
en: He will become a universal teacher who is greatly honored by everyone. “

source: །སྦྱིན་སྲེག་གི་ཆོ་གའི་སྒྲུབ་ཐབས་སོ།། །།
en: This concludes the homa practice procedure. “

source: དེ་ནས་མིག་འཕྲུལ་བཤད་པར་བྱ་སྟེ། དོན་ཡོད་པ་པདྨ་གཙུག་ཏོར་གྱི་རིག་སྔགས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་དོན་གྱི་ཆེད་དུ་ལས་ཐམས་ཅད་བྱེད་པ།
en: Now I will teach, for the benefit of all beings, the art of magic that involves the vidyā of Amogha­padmoṣṇīṣa.

source: དགེ་བ་ལ་མཁས་པ་རྣམས་ཀྱི་བདེ་བ་སྦྱིན་པ། རྟག་ཏུ་དབུལ་པོ་རྣམས་ཀྱིས་བདེ་བ་ཐོབ་པར་བྱེད་པའོ།
en: This magic accomplishes all the good activities of the learned ones, always brings happiness, and grants comfort to the poor.

source: །དེ་ནས་རྟོགས་པའི་མོད་ལ་འབྲུ་མཆོག་ཏུ་འཕེལ་བར་འགྱུར་ཞིང་།
en: It brings instant gains, such as a great increase of grain.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་བླ་མ་ཉིད་དུ་མཆོད་པར་བྱ་བ་དང་། མི་འཇིགས་པ་དང་།
en: Through it the fearless vidyā holder will become the sole teacher of everyone and be revered by all.

source: དབང་ཕྱུག་སྦྱིན་ཞིང་། ལོངས་སྤྱོད་ཆེན་པོ་འཕེལ་བ་དང་། རྒྱལ་པོའི་བདེ་བ་དང་ལྡན་པ་དང་ཕྱོགས་ཕྱོགས་སུ་རབ་མཆོག་སྦྱིན་པར་བྱེད་དོ། །གི་ཝང་དང་།
en: His power and pleasures will greatly increase, and he will enjoy the comforts of a king. “

source: ཅུ་གང་དང་། ལྡོང་རོས་དང་། མུ་ཟི་དང་། པདྨ་གེ་སར་དང་། ཨུཏྤལ་སྔོན་པོ་དང་། ལི་ཁ་ར་དང་། གུར་གུམ་དང་། རྒྱ་མཚོ་ལྦུ་བ་དང་།
en: The vidyā holder should procure the finest arjun flowers, bovine bezoar, bamboo juice, realgar, myrrh, lotus filaments, blue lotuses, white sugar, saffron, the bones of a cuttle fish, two rajana leaves, and one thousand suvarṇa leaves.

source: གཉིས་དང་། གསེར་གྱི་འདབ་མ་སྟོང་ཕྲག་སྦྱར་ཏེ། ཕྱེ་མ་ཤིན་ཏུ་ཞིབ་མོར་བྱས་ལ་ལེགས་པར་བསྒོངས་ལག་པུར་དང་། གླ་རྩི་ཙམ་གྱི་བླངས་ལ།
en: He should combine them together, grind them into a fine powder, and blend them with camphor and musk.

source: སྔགས་ཀྱི་སྟོང་ཕྲག་བརྒྱད་བཟླས་པ།
en: As soon as he wakes up in the morning he should incant the mixture one thousand and eight times with the mantra.

source: མཁས་པས་རྣམ་པ་གསུམ་དུ་སྦྱར་བར་བྱ་སྟེ། སྐྱེ་བོས་གང་བ་ཉིད་ལ་ལྔ་མཉམ་པའོ།
en: The wise vidyā holder can use the preparation in three different ways.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་མིག་སྨན་གྱི་སྙིང་པོས་སྟོང་རྩ་བརྒྱད་བཟླས་ལ་མིག་ལ་བྱུག་པར་བྱ་སྟེ་མི་སྣང་བར་འགྱུར་རོ།
en: If he wants to use it as an eye ointment, he should further incant it one thousand and eight times with the heart mantra. If he anoints his eyes with it, he will become invisible.

source: །སྐྱེ་བོ་མང་པོའི་དབུས་སུ་ནམ་མཁའ་ལ་ཉེ་བར་གནས་པར་བྱེད་དོ།
en: He will be able to enter a large crowd of people and remain there as if in an empty space. “

source: །ཧཱུྃ་ཡིག་གིས་མཐོང་བར་བྱའོ། །ནམ་མཁའ་ལ་འགྲོ་བར་བྱེད་དོ། །གནས་པར་བྱེད་དོ། །ཉལ་བར་བྱེད་དོ། །རྒྱུག་པར་བྱེད་དོ།
en: If he recites the syllable hūṁ, he will become visible again and will be able to ascend into the air, where he can stand up, lie down, or run.

source: །བསྐུས་ན་ལུས་ལ་མེ་འབར་བར་མཐོང་སྟེ། དེ་སྟོན་པར་བྱེད་དོ། །དུ་བའི་རྒྱལ་མཚན་སྟོན་པར་བྱེད་དོ།
en: If he anoints his body with the preparation, it will appear as if blazing with fire, and it will be able to manifest fire and smoke.

source: །རྐང་པའི་མཐིལ་ལ་ཀུན་དུ་བྱུགས་ན། ཆུ་བོ་དང་། ཆུ་ཀླུང་ཆེན་པོའི་སྟེང་ནས་འགྲོ་སྟེ་རྐང་པ་ལ་ཆུས་གོས་པར་མི་འགྱུར་རོ།
en: If he anoints the soles of his feet, he will be able to walk on the water of a large river without getting his feet wet.

source: །མེ་ཆེན་པོ་འབར་བའི་ནང་དུ་འཇུག་སྟེ། སྲེག་པར་མི་བྱེད་ཅིང་། བ་སྤུའི་ཁུང་བུ་གཅིག་ཀྱང་འབྱི་བར་མི་འགྱུར་རོ།
en: He will be able to enter a large, blazing fire without getting burnt or even losing a single hair on his body.

source: །ཕྱེ་མས་ཕྱོགས་བཞིར་ནམ་མཁའ་ཀུན་དུ་གཏོར་ན། མེ་ཏོག་དང་། འབྲས་བུ་སྣ་ཚོགས་པའི་ཆར་གྱི་རྒྱུན་ལྟུང་བར་བྱེད་དོ། །རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་གཞལ་མེད་ཁང་མཐོང་བར་བྱེད་དོ།
en: If he casts the powdered preparation into the air in each of the four directions, he will cause a rain of various flowers and fruits to fall in torrents and will conjure various jeweled palaces. “

source: །ལུས་མཐའ་དག་ལ་བྱུག་པར་བྱ་ཞིང་། སྐྱེ་བོའི་མིག་སྨན་བསྐུ་ཞིང་ཕྱེ་མས་གཏོར་ནས། ལྗོངས་ཆེན་པོའི་ནང་དུ་འཇུག་པར་བྱ་སྟེ། དེ་ཅུང་ཟད་ཀྱང་མི་མཐོང་ངོ་།
en: If he anoints his entire body with the ointment, applies the eye ointment, and sprinkles his body with the powder, he will be able to enter a large settlement without anyone noticing.
